# WAVES

In [1]:
import pyodbc
import pandas as pd

In [2]:
cnxn = pyodbc.connect("Driver={SQL Server Native Client 11.0};"
                        "Server=wd02;"
                        "Database=FootPrint;"
                        "UID=WOODFIELD\\jmeza@wdsrx.com;"
                        "PWD=Clavezaza2022;"
                        "Trusted_Connection=yes;")

### Query

In [3]:
df = pd.read_sql_query("SELECT CONVERT(varchar,w.releaseDate,100) Date, w.id, wa.name Warehouse, s.lookupCode Shipments, p.name Customer, ss.name ShipmentStatus\
    FROM datex_footprint.Waves w\
    JOIN datex_footprint.WaveStatuses ws\
        ON ws.id = w.statusId\
    JOIN datex_footprint.Warehouses wa\
        ON wa.id = w.warehouseId\
    JOIN datex_footprint.shipments s\
        ON s.waveId = w.id\
    JOIN datex_footprint.ShipmentOrderLookup sol\
        ON sol.shipmentId = s.id\
    JOIN datex_footprint.Orders o\
        ON o.id = sol.orderId\
    JOIN datex_footprint.Projects p\
        ON p.id = o.projectId\
    JOIN datex_footprint.ShipmentStatuses ss\
        ON ss.id = s.statusId\
    WHERE releaseDate > dateadd(day,-1,getdate())\
        AND w.statusId = 3\
    ORDER BY releaseDate DESC", cnxn)

# Create Waves Table Data

In [4]:
df.head(10)

,Date,id,Warehouse,Shipments,Customer,ShipmentStatus
0,Nov 9 2022 10:11AM,250390,21,415567876,"NBTY Global, Inc.",Released
1,Nov 9 2022 10:02AM,250388,21,633019,"NBTY Global, Inc.",Released
2,Nov 9 2022 10:02AM,250387,21,632621,"NBTY Global, Inc.",Released
3,Nov 9 2022 10:02AM,250386,21,632620,"NBTY Global, Inc.",Released
4,Nov 9 2022 10:01AM,250385,21,632182,"NBTY Global, Inc.",Released
5,Nov 9 2022 10:01AM,250384,21,632183,"NBTY Global, Inc.",Released
6,Nov 9 2022 9:41AM,250383,20,8753427,"Emersa Waterbox, LLC",Released
7,Nov 9 2022 9:29AM,250381,20,ATR-I000021,"HVL, LLC dba Atrium Innovations",Released
8,Nov 9 2022 9:27AM,250379,10,Eme-105695,Emerginnova,Released
9,Nov 9 2022 9:23AM,250377,10,0086151501,ISDIN Corporation,Executing

In [5]:
# Count Shipments per Wave and Status
count_shipments_statusdf = df.groupby(['id', 'ShipmentStatus']).count()[['Shipments']]
count_shipments_statusdf.reset_index(inplace=True)
count_shipments_statusdf.tail()

        id ShipmentStatus  Shipments
27  250385       Released          1
28  250386       Released          1
29  250387       Released          1
30  250388       Released          1
31  250390       Released          1

In [6]:
# Convert Statuses to Columns
shipment_pivot = count_shipments_statusdf.pivot(index='id', columns='ShipmentStatus', values='Shipments')
shipment_pivot.tail()

ShipmentStatus  Completed  Executing  Released
id
250385                NaN        NaN       1.0
250386                NaN        NaN       1.0
250387                NaN        NaN       1.0
250388                NaN        NaN       1.0
250390                NaN        NaN       1.0

In [7]:
# Convert NaN to 0
shipment_pivot = shipment_pivot.fillna(0)
shipment_pivot.head()

ShipmentStatus  Completed  Executing  Released
id
250136                0.0        3.0      21.0
250280                0.0        9.0      35.0
250291                0.0        0.0       1.0
250299                0.0        0.0       1.0
250311                0.0        0.0       1.0

In [8]:
# Convert Float to Int
try:
    shipment_pivot['Completed'] = shipment_pivot['Completed'].astype(int)
except:
    print('Column Completed does not exist yet')

try:
    shipment_pivot['Executing'] = shipment_pivot['Executing'].astype(int)
except:
    print('Column Executing does not exist yet')

try:
    shipment_pivot['Released'] = shipment_pivot['Released'].astype(int)
except:
    print('Column Released does not exist yet')

shipment_pivot.head()

ShipmentStatus  Completed  Executing  Released
id
250136                  0          3        21
250280                  0          9        35
250291                  0          0         1
250299                  0          0         1
250311                  0          0         1

In [9]:
# Convert id index to a column
shipment_pivot.reset_index(inplace=True)
shipment_pivot.head()

ShipmentStatus      id  Completed  Executing  Released
0               250136          0          3        21
1               250280          0          9        35
2               250291          0          0         1
3               250299          0          0         1
4               250311          0          0         1

In [10]:
# Convert zeros to blanks. This also change the data type to String
try:
    shipment_pivot['Completed'].replace([0, ''], '', inplace=True)
except:
    print('Column Completed does not exist yet')
    
try:
    shipment_pivot['Executing'].replace([0, ''], '', inplace=True)
except:
    print('Column Executing does not exist yet')

try:
    shipment_pivot['Released'].replace([0, ''], '', inplace=True)
except:
    print('Column Released does not exist yet')
    
shipment_pivot.head()

ShipmentStatus      id Completed Executing Released
0               250136                   3       21
1               250280                   9       35
2               250291                            1
3               250299                            1
4               250311                            1

In [11]:
shipment_pivot.dtypes

ShipmentStatus
id            int64
Completed    object
Executing    object
Released     object
dtype: object

In [12]:
# Change columns order
df = df[['Date', 'id', 'Warehouse', 'Customer']]

In [13]:
# Drops duplicates
df = df.drop_duplicates()

In [14]:
df.head(10)

                  Date      id Warehouse                         Customer
0  Nov  9 2022 10:11AM  250390        21                NBTY Global, Inc.
1  Nov  9 2022 10:02AM  250388        21                NBTY Global, Inc.
2  Nov  9 2022 10:02AM  250387        21                NBTY Global, Inc.
3  Nov  9 2022 10:02AM  250386        21                NBTY Global, Inc.
4  Nov  9 2022 10:01AM  250385        21                NBTY Global, Inc.
5  Nov  9 2022 10:01AM  250384        21                NBTY Global, Inc.
6  Nov  9 2022  9:41AM  250383        20             Emersa Waterbox, LLC
7  Nov  9 2022  9:29AM  250381        20  HVL, LLC dba Atrium Innovations
8  Nov  9 2022  9:27AM  250379        10                      Emerginnova
9  Nov  9 2022  9:23AM  250377        10                ISDIN Corporation

In [15]:
# Merge df with pivot table
df2 = df.merge(shipment_pivot, left_on='id', right_on='id')
df2.head(10)

,Date,id,Warehouse,Customer,Completed,Executing,Released
0,Nov 9 2022 10:11AM,250390,21,"NBTY Global, Inc.",,,1
1,Nov 9 2022 10:02AM,250388,21,"NBTY Global, Inc.",,,1
2,Nov 9 2022 10:02AM,250387,21,"NBTY Global, Inc.",,,1
3,Nov 9 2022 10:02AM,250386,21,"NBTY Global, Inc.",,,1
4,Nov 9 2022 10:01AM,250385,21,"NBTY Global, Inc.",,,1
5,Nov 9 2022 10:01AM,250384,21,"NBTY Global, Inc.",,,1
6,Nov 9 2022 9:41AM,250383,20,"Emersa Waterbox, LLC",,,1
7,Nov 9 2022 9:29AM,250381,20,"HVL, LLC dba Atrium Innovations",,,1
8,Nov 9 2022 9:27AM,250379,10,Emerginnova,,,1
9,Nov 9 2022 9:23AM,250377,10,ISDIN Corporation,,7,13

In [16]:
wave_df = pd.DataFrame()
statuses = list(df2.columns)

# Reorder columns
if ('Released' in statuses) and ('Executing' in statuses) and ('Completed' in statuses):
    wave_df = df2[['Date', 'id', 'Warehouse', 'Customer', 'Released', 'Executing', 'Completed']]
elif ('Released' in statuses) and ('Executing' in statuses):
    wave_df = df2[['Date', 'id', 'Warehouse', 'Customer', 'Released', 'Executing']]
elif ('Released' in statuses) and ('Completed' in statuses):
    wave_df = df2[['Date', 'id', 'Warehouse', 'Customer', 'Released', 'Completed']]
elif ('Released' in statuses):
    wave_df = df2[['Date', 'id', 'Warehouse', 'Customer', 'Released']]
else:
    wave_df = df2[['Date', 'id', 'Warehouse', 'Customer']]

In [17]:
wave_df.head(10)

,Date,id,Warehouse,Customer,Released,Executing,Completed
0,Nov 9 2022 10:11AM,250390,21,"NBTY Global, Inc.",1,,
1,Nov 9 2022 10:02AM,250388,21,"NBTY Global, Inc.",1,,
2,Nov 9 2022 10:02AM,250387,21,"NBTY Global, Inc.",1,,
3,Nov 9 2022 10:02AM,250386,21,"NBTY Global, Inc.",1,,
4,Nov 9 2022 10:01AM,250385,21,"NBTY Global, Inc.",1,,
5,Nov 9 2022 10:01AM,250384,21,"NBTY Global, Inc.",1,,
6,Nov 9 2022 9:41AM,250383,20,"Emersa Waterbox, LLC",1,,
7,Nov 9 2022 9:29AM,250381,20,"HVL, LLC dba Atrium Innovations",1,,
8,Nov 9 2022 9:27AM,250379,10,Emerginnova,1,,
9,Nov 9 2022 9:23AM,250377,10,ISDIN Corporation,13,7,

In [18]:
# Save Waves DF into json file
wave_df.to_json('data/waves.json')

# Warehouse Pie Chart Data

In [19]:
# Save df2 in df3
warehouse_df = wave_df
warehouse_df.head()

,Date,id,Warehouse,Customer,Released,Executing,Completed
0,Nov 9 2022 10:11AM,250390,21,"NBTY Global, Inc.",1,,
1,Nov 9 2022 10:02AM,250388,21,"NBTY Global, Inc.",1,,
2,Nov 9 2022 10:02AM,250387,21,"NBTY Global, Inc.",1,,
3,Nov 9 2022 10:02AM,250386,21,"NBTY Global, Inc.",1,,
4,Nov 9 2022 10:01AM,250385,21,"NBTY Global, Inc.",1,,

In [20]:
# Conver String to Float
try:
    warehouse_df['Released'] = pd.to_numeric(warehouse_df['Released'],errors='coerce')
except:
    print('Column Released does not exist yet')

try:
    warehouse_df['Executing'] = pd.to_numeric(warehouse_df['Executing'],errors='coerce')
except:
    print('Column Executing does not exist yet')

try:
    warehouse_df['Completed'] = pd.to_numeric(warehouse_df['Completed'],errors='coerce')
except:
    print('Column Completed does not exist yet')

warehouse_df.head()

,Date,id,Warehouse,Customer,Released,Executing,Completed
0,Nov 9 2022 10:11AM,250390,21,"NBTY Global, Inc.",1.0,NaN,NaN
1,Nov 9 2022 10:02AM,250388,21,"NBTY Global, Inc.",1.0,NaN,NaN
2,Nov 9 2022 10:02AM,250387,21,"NBTY Global, Inc.",1.0,NaN,NaN
3,Nov 9 2022 10:02AM,250386,21,"NBTY Global, Inc.",1.0,NaN,NaN
4,Nov 9 2022 10:01AM,250385,21,"NBTY Global, Inc.",1.0,NaN,NaN

In [21]:
# Conver NaN to Zero
warehouse_df = warehouse_df.fillna(0)
warehouse_df.head()

,Date,id,Warehouse,Customer,Released,Executing,Completed
0,Nov 9 2022 10:11AM,250390,21,"NBTY Global, Inc.",1.0,0.0,0.0
1,Nov 9 2022 10:02AM,250388,21,"NBTY Global, Inc.",1.0,0.0,0.0
2,Nov 9 2022 10:02AM,250387,21,"NBTY Global, Inc.",1.0,0.0,0.0
3,Nov 9 2022 10:02AM,250386,21,"NBTY Global, Inc.",1.0,0.0,0.0
4,Nov 9 2022 10:01AM,250385,21,"NBTY Global, Inc.",1.0,0.0,0.0

In [22]:
# Group by Warehouse
warehouse_df = warehouse_df.groupby(['Warehouse']).sum()
warehouse_df

                id  Released  Executing  Completed
Warehouse
10         1001505      87.0        7.0        0.0
15         1001098      91.0       12.0       69.0
16         1251723       5.0        0.0        0.0
19          750955       8.0        3.0        0.0
20          500764       2.0        0.0        0.0
21         2253351       7.0        2.0        0.0

In [23]:
# Reset Index
warehouse_df.reset_index(inplace=True)
warehouse_df

  Warehouse       id  Released  Executing  Completed
0        10  1001505      87.0        7.0        0.0
1        15  1001098      91.0       12.0       69.0
2        16  1251723       5.0        0.0        0.0
3        19   750955       8.0        3.0        0.0
4        20   500764       2.0        0.0        0.0
5        21  2253351       7.0        2.0        0.0

In [24]:
warehouses = list(warehouse_df.columns)
warehouse_df2 = pd.DataFrame()

if ('Released' in warehouses) and ('Executing' in warehouses) and ('Completed' in warehouses):
    warehouse_df2 = warehouse_df[['Warehouse', 'Released', 'Executing', 'Completed']]
elif ('Released' in warehouses) and ('Executing' in warehouses):
    warehouse_df2 = warehouse_df[['Warehouse', 'Released', 'Executing']]
elif ('Released' in warehouses) and ('Completed' in warehouses):
    warehouse_df2 = warehouse_df[['Warehouse', 'Released', 'Completed']]
elif ('Released' in warehouses):
    warehouse_df2 = warehouse_df[['Warehouse', 'Released']]
else:
    warehouse_df2 = warehouse_df[['Warehouse']]

warehouse_df2

  Warehouse  Released  Executing  Completed
0        10      87.0        7.0        0.0
1        15      91.0       12.0       69.0
2        16       5.0        0.0        0.0
3        19       8.0        3.0        0.0
4        20       2.0        0.0        0.0
5        21       7.0        2.0        0.0

In [25]:
warehouse_df2 = pd.melt(warehouse_df2, id_vars=["Warehouse"], 
                  var_name="Status", value_name="Value")
warehouse_df2.head()

  Warehouse    Status  Value
0        10  Released   87.0
1        15  Released   91.0
2        16  Released    5.0
3        19  Released    8.0
4        20  Released    2.0

In [26]:
warehouse_df3 = warehouse_df2.pivot(index ='Status', columns='Warehouse', values='Value')
warehouse_df3

Warehouse    10    15   16   19   20   21
Status
Completed   0.0  69.0  0.0  0.0  0.0  0.0
Executing   7.0  12.0  0.0  3.0  0.0  2.0
Released   87.0  91.0  5.0  8.0  2.0  7.0

In [27]:
warehouse_df4 = warehouse_df3.reset_index()
warehouse_df4

Warehouse     Status    10    15   16   19   20   21
0          Completed   0.0  69.0  0.0  0.0  0.0  0.0
1          Executing   7.0  12.0  0.0  3.0  0.0  2.0
2           Released  87.0  91.0  5.0  8.0  2.0  7.0

In [28]:
warehouse_df4 = warehouse_df4.rename_axis(None, axis=1)
warehouse_df4

      Status    10    15   16   19   20   21
0  Completed   0.0  69.0  0.0  0.0  0.0  0.0
1  Executing   7.0  12.0  0.0  3.0  0.0  2.0
2   Released  87.0  91.0  5.0  8.0  2.0  7.0

In [29]:
# Save Warehouse into JSON file
warehouse_df4.to_json('data/warehouse.json')

In [30]:
# Close connection
cnxn.close()